pok3r-custom/pok3r_re_firmware/firmware/demo/lib/ht32f1655_56_usbd.c
/*********************************************************************************************************//**
  * @brief  USB Device Peripheral initialization.
  * @param  pDriver: USB initialization structure
  * @retval None
  ***********************************************************************************************************/
void USBD_Init(u32 *pDriver)
{
  USBD_Driver_TypeDef *pDrv = (USBD_Driver_TypeDef *)pDriver;

  /* Init USB Device Driver struct                                                                          */
  USBD_PreInit(pDrv);

  return;
}

/*********************************************************************************************************//**
  * @brief  USB Device Internal DP pull up.
  * @param  NewState: ENABLE or DISABLE
  * @retval None
  ***********************************************************************************************************/
void USBD_DPpullupCmd(ControlStatus NewState)
{
  (NewState == ENABLE)?(HT_USB->CSR |= DPPUEN):(HT_USB->CSR &= ~DPPUEN);
}

/*********************************************************************************************************//**
  * @brief  USB Device Wake Up when DP is high level.
  * @param  NewState: ENABLE or DISABLE
  * @retval None
  ***********************************************************************************************************/
void USBD_DPWakeUpCmd(ControlStatus NewState)
{
  (NewState == ENABLE)?(HT_USB->CSR |= DPWKEN):(HT_USB->CSR &= ~DPWKEN);
}

/*********************************************************************************************************//**
  * @brief  USB Device Peripheral deinitialization.
  * @retval None
  ***********************************************************************************************************/
void USBD_DeInit(void)
{
  RSTCU_PeripReset_TypeDef RSTCUReset = {{0}};

  RSTCUReset.Bit.USBD = 1;
  RSTCU_PeripReset(RSTCUReset, ENABLE);

  return;
}

/*********************************************************************************************************//**
  * @brief  USB power up procedure.
  * @retval None
  ***********************************************************************************************************/
void USBD_PowerUp(u32 *pDriver, u32 uIsSelfPowered)
{
  USBD_Driver_TypeDef *pDrv = (USBD_Driver_TypeDef *)pDriver;

  if (gIsFirstPowered == TRUE)
  {
    gIsFirstPowered = FALSE;

    if (HT_USB->CSR & 0x40)
    {
      HT_USB->CSR = (DPPUEN | LPMODE | PDWN);
      HT_USB->ISR = 0xFFFFFFFF;
      if (uIsSelfPowered == FALSE)
      {
        USBDCore_LowPower();
      }
      USBD_EnableINT(pDrv->uInterruptMask);
    }
    else
    {
      HT_USB->CSR = (DPWKEN | DPPUEN | LPMODE | PDWN);
      HT_USB->ISR = 0xFFFFFFFF;
      if (uIsSelfPowered == FALSE)
      {
        USBDCore_LowPower();
      }
      USBD_DPWakeUpCmd(DISABLE);
      USBD_EnableINT(pDrv->uInterruptMask);
      USBD_DPpullupCmd(DISABLE);
      _delay(200);
      USBD_DPpullupCmd(ENABLE);
    }
  }

  return;
}

/*********************************************************************************************************//**
  * @brief  Enter USB Device Power Down mode.
  * @retval None
  ***********************************************************************************************************/
void USBD_PowerOff(void)
{
  HT_USB->CSR |= (LPMODE | PDWN);
  return;
}

/*********************************************************************************************************//**
  * @brief  Exit USB Device Power Down mode.
  * @retval None
  ***********************************************************************************************************/
void USBD_PowerOn(void)
{
  HT_USB->CSR &= 0x00000400;
  return;
}

/*********************************************************************************************************//**
  * @brief  USB SRAM reset condition.
  * @param  NewState: ENABLE or DISABLE
  * @retval None
  ***********************************************************************************************************/
void USBD_SRAMResetConditionCmd(ControlStatus NewState)
{
  (NewState == ENABLE)?(HT_USB->CSR |= SRAMRSTC):(HT_USB->CSR &= ~SRAMRSTC);
}

/*********************************************************************************************************//**
  * @brief  Generate a resume request to USB Host for Remote Wakeup function.
  * @retval None
  ***********************************************************************************************************/
void USBD_RemoteWakeup(void)
{
  HT_USB->CSR |= GENRSM;
  return;
}

/*********************************************************************************************************//**
  * @brief  Read Endpoint0 SETUP data from USB Buffer.
  * @param  pBuffer: Buffer for save SETUP data
  * @retval None
  ***********************************************************************************************************/
void USBD_ReadSETUPData(u32 *pBuffer)
{
  u32 *pSrc = (u32 *)HT_USB_SRAM_BASE;

  *pBuffer = *pSrc;
  *(pBuffer + 1) = *(pSrc + 1);
  return;
}

/*********************************************************************************************************//**
  * @brief  Set USB Device address.
  * @param  address: USB address which specified by Host
  * @retval None
  ***********************************************************************************************************/
void USBD_SetAddress(u32 address)
{
  HT_USB->CSR   |= ADRSET;
  HT_USB->DEVAR = address;
  return;
}

/*********************************************************************************************************//**
  * @brief  Enable USB Device interrupt.
  * @param  INTFlag: USB Device global interrupt flag
  *         @arg UGIE  | SOFIE  | URSTIE | RSMIE  | SUSPIE | ESOFIE
  *              EP0IE | EP1IE  | EP2IE  | EP3IE  | EP4IE  | EP5IE  | EP6IE  | EP7IE
  * @retval None
  ***********************************************************************************************************/
void USBD_EnableINT(u32 INTFlag)
{
  HT_USB->IER |= INTFlag;
  return;
}

